; ModuleID = 'init'
source_filename = "init.rcp"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%string = type { ptr, i64 }
%slice.5 = type { i64, ptr }
%init.TypeInfo = type { i64, %init.TypeUnion }
%init.TypeUnion = type { %init.StructType }
%init.StructType = type { %slice, %string, i32 }
%slice = type { i64, ptr }
%init.StructMember = type { %string, i64 }
%init.BasicType = type { i64, i32, i32, %string }
%init.PointerType = type { i64, i1 }
%init.EnumType = type { %string, %slice.2, i64 }
%slice.2 = type { i64, ptr }
%slice.1 = type { i64, ptr }
%init.FunctionType = type { %slice.1, %slice.1 }
%init.ArrayType = type { i64, i32 }

@main.test_string = external global %string
@init.INVALID_TYPE = global i64 0
@init.type_table = global %slice.5 zeroinitializer
@os.STD_INPUT_HANDLE = external global i32
@os.STD_OUTPUT_HANDLE = external global i32
@os.STD_ERROR_HANDLE = external global i32
@os.INVALID_HANDLE_VALUE = external global ptr
@os.CP_UTF7 = external global i32
@os.CP_UTF8 = external global i32
@os.MEM_COMMIT = external global i32
@os.MEM_RESERVE = external global i32
@os.MEM_RELEASE = external global i32
@os.PAGE_NOACCESS = external global i32
@os.PAGE_READONLY = external global i32
@os.PAGE_READWRITE = external global i32
@os.PAGE_WRITECOPY = external global i32
@os.PAGE_EXECUTE = external global i32
@os.PAGE_EXECUTE_READ = external global i32

!11 = !DIEnumerator(name: "Slice", value: 6, isUnsigned: true)
!12 = !DIEnumerator(name: "Vector", value: 7, isUnsigned: true)
!13 = !DIEnumerator(name: "Enum", value: 8, isUnsigned: true)
!14 = !DIEnumerator(name: "Generic", value: 9, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "init.BasicKind", scope: !1, file: !1, size: 64, align: 64, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35}
!17 = !DIEnumerator(name: "Bool", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "String", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "U8", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "U16", value: 3, isUnsigned: true)
!21 = !DIEnumerator(name: "U32", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "U64", value: 5, isUnsigned: true)
!23 = !DIEnumerator(name: "I8", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "I16", value: 7, isUnsigned: true)
!25 = !DIEnumerator(name: "I32", value: 8, isUnsigned: true)
!26 = !DIEnumerator(name: "I64", value: 9, isUnsigned: true)
!27 = !DIEnumerator(name: "F32", value: 10, isUnsigned: true)
!28 = !DIEnumerator(name: "F64", value: 11, isUnsigned: true)
!29 = !DIEnumerator(name: "untypedInteger", value: 12, isUnsigned: true)
!30 = !DIEnumerator(name: "untypedFloat", value: 13, isUnsigned: true)
!31 = !DIEnumerator(name: "Int", value: 14, isUnsigned: true)
!32 = !DIEnumerator(name: "Uint", value: 15, isUnsigned: true)
!33 = !DIEnumerator(name: "Type", value: 16, isUnsigned: true)
!34 = !DIEnumerator(name: "Auto", value: 17, isUnsigned: true)
!35 = !DIEnumerator(name: "Module", value: 18, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "init.BasicFlag", scope: !1, file: !1, size: 32, align: 32, elements: !37)
!37 = !{!38, !39, !40, !41, !42, !43, !44}
!38 = !DIEnumerator(name: "Boolean", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "Integer", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "Float", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "String", value: 8, isUnsigned: true)
!42 = !DIEnumerator(name: "Untyped", value: 32, isUnsigned: true)
!43 = !DIEnumerator(name: "Unsigned", value: 64, isUnsigned: true)
!44 = !DIEnumerator(name: "TypeID", value: 128, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "init.StructFlag", scope: !1, file: !1, size: 32, align: 32, elements: !46)
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "Packed", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "Generic", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "Union", value: 4, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "init.VectorKind", scope: !1, file: !1, size: 64, align: 64, elements: !51)
!51 = !{!52, !53}
!52 = !DIEnumerator(name: "Float", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "Int", value: 1, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "compile.CompileFlag", scope: !1, file: !1, size: 32, align: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64}
!56 = !DIEnumerator(name: "Debug", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "SanAddress", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "SanMemory", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "SanThread", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "SanUndefined", value: 16, isUnsigned: true)
!61 = !DIEnumerator(name: "NoStdLib", value: 32, isUnsigned: true)
!62 = !DIEnumerator(name: "SharedLib", value: 64, isUnsigned: true)
!63 = !DIEnumerator(name: "CrossAndroid", value: 128, isUnsigned: true)
!64 = !DIEnumerator(name: "NoLink", value: 256, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "compile.Arch", scope: !1, file: !1, size: 32, align: 32, elements: !66)
!66 = !{!67, !68, !69, !70}
!67 = !DIEnumerator(name: "x86_64", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "x86", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "Arm32", value: 2, isUnsigned: true)
!70 = !DIEnumerator(name: "Arm64", value: 4, isUnsigned: true)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "json.Type", scope: !1, file: !1, size: 64, align: 64, elements: !72)
!72 = !{!73, !74, !75, !76, !77, !78, !79}
!73 = !DIEnumerator(name: "Number", value: 0, isUnsigned: true)
!74 = !DIEnumerator(name: "Integer", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "String", value: 2, isUnsigned: true)
!76 = !DIEnumerator(name: "Object", value: 3, isUnsigned: true)
!77 = !DIEnumerator(name: "Array", value: 4, isUnsigned: true)
!78 = !DIEnumerator(name: "Boolean", value: 5, isUnsigned: true)
!79 = !DIEnumerator(name: "Null", value: 6, isUnsigned: true)
!80 = !{i32 2, !"CodeView", i32 1}
!81 = !{i32 2, !"Debug Info Version", i32 3}
!82 = distinct !DISubprogram(name: "get_struct_alignment", linkageName: "init.get_struct_alignment", scope: !1, file: !1, line: 155, type: !83, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !87)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !86}
!85 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!86 = !DIBasicType(name: "type", size: 64, encoding: DW_ATE_unsigned)
!87 = !{}
!88 = !DILocation(line: 155, scope: !82)
!89 = !DILocalVariable(name: "st", scope: !82, file: !1, line: 155, type: !86)
!90 = !DILocation(line: 156, scope: !82)
!91 = !DILocalVariable(name: "t", scope: !82, file: !1, line: 156, type: !92)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.StructType", scope: !1, file: !1, size: 320, elements: !93)
!93 = !{!94, !110, !111}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "members", scope: !1, file: !1, baseType: !95, size: 128, align: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1, file: !1, size: 128, align: 64, elements: !96)
!96 = !{!97, !98}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1, file: !1, baseType: !85, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !99, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*init.StructMember", baseType: !100, size: 64, align: 64, dwarfAddressSpace: 0)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.StructMember", scope: !1, file: !1, size: 192, elements: !101)
!101 = !{!102, !109}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1, file: !1, baseType: !103, size: 128, align: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", scope: !1, file: !1, size: 128, elements: !104)
!104 = !{!105, !108}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u8", baseType: !107, size: 64, align: 64, dwarfAddressSpace: 0)
!107 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1, file: !1, baseType: !85, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !86, size: 64, align: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1, file: !1, baseType: !103, size: 128, align: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1, file: !1, baseType: !112, size: 32, align: 32, offset: 256)
!112 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!113 = !DILocation(line: 157, scope: !82)
!114 = !DILocation(line: 158, scope: !82)
!115 = !DILocation(line: 160, scope: !82)
!116 = !DILocalVariable(name: "biggest", scope: !82, file: !1, line: 160, type: !85)
!117 = !DILocation(line: 161, scope: !82)
!118 = !DILocalVariable(name: "align", scope: !82, file: !1, line: 161, type: !85)
!119 = !DILocation(line: 162, scope: !82)
!120 = !DILocalVariable(name: "m", scope: !82, file: !1, line: 162, type: !100)
!121 = !DILocalVariable(name: "i", scope: !82, file: !1, line: 162, type: !85)
!122 = !DILocation(line: 163, scope: !82)
!123 = !DILocalVariable(name: "size", scope: !82, file: !1, line: 163, type: !85)
!124 = !DILocation(line: 164, scope: !82)
!125 = !DILocation(line: 165, scope: !82)
!126 = !DILocation(line: 166, scope: !82)
!127 = !DILocation(line: 170, scope: !82)
!128 = distinct !DISubprogram(name: "get_type_alignment", linkageName: "init.get_type_alignment", scope: !1, file: !1, line: 173, type: !83, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !87)
!129 = !DILocation(line: 173, scope: !128)
!130 = !DILocalVariable(name: "t", scope: !128, file: !1, line: 173, type: !86)
!131 = !DILocation(line: 174, scope: !128)
!132 = !DILocalVariable(name: "ti", scope: !128, file: !1, line: 174, type: !133)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.TypeInfo", scope: !1, file: !1, size: 384, elements: !134)
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !1, file: !1, baseType: !3, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !137, size: 320, align: 64, offset: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.TypeUnion", scope: !1, file: !1, size: 320, elements: !138)
!138 = !{!139, !145, !146, !155, !161, !166, !169, !178, !183}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !1, file: !1, baseType: !140, size: 256, align: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.BasicType", scope: !1, file: !1, size: 256, elements: !141)
!141 = !{!142, !143, !144, !110}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !1, file: !1, baseType: !15, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1, file: !1, baseType: !112, size: 32, align: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1, file: !1, baseType: !112, size: 32, align: 32, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "struct_", scope: !1, file: !1, baseType: !92, size: 320, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !1, file: !1, baseType: !147, size: 256, align: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.FunctionType", scope: !1, file: !1, size: 256, elements: !148)
!148 = !{!149, !154}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "returns", scope: !1, file: !1, baseType: !150, size: 128, align: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1, file: !1, size: 128, align: 64, elements: !151)
!151 = !{!97, !152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !153, size: 64, align: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*type", baseType: !86, size: 64, align: 64, dwarfAddressSpace: 0)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "args_t", scope: !1, file: !1, baseType: !150, size: 128, align: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1, file: !1, baseType: !156, size: 128, align: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.PointerType", scope: !1, file: !1, size: 128, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "pointee", scope: !1, file: !1, baseType: !86, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "is_optional", scope: !1, file: !1, baseType: !160, size: 8, align: 8, offset: 64)
!160 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !1, file: !1, baseType: !162, size: 128, align: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.ArrayType", scope: !1, file: !1, size: 128, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !86, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "member_count", scope: !1, file: !1, baseType: !112, size: 32, align: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !1, file: !1, baseType: !167, size: 64, align: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.SliceType", scope: !1, file: !1, size: 64, elements: !168)
!168 = !{!164}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "enum_", scope: !1, file: !1, baseType: !170, size: 320, align: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.EnumType", scope: !1, file: !1, size: 320, elements: !171)
!171 = !{!102, !172, !177}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "member_names", scope: !1, file: !1, baseType: !173, size: 128, align: 64, offset: 128)
!173 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1, file: !1, size: 128, align: 64, elements: !174)
!174 = !{!97, !175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !176, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*string", baseType: !103, size: 64, align: 64, dwarfAddressSpace: 0)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !86, size: 64, align: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1, file: !1, baseType: !179, size: 128, align: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.VectorType", scope: !1, file: !1, size: 128, elements: !180)
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !1, file: !1, baseType: !50, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "elem_count", scope: !1, file: !1, baseType: !112, size: 32, align: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !1, file: !1, baseType: !184, size: 128, align: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.GenericType", scope: !1, file: !1, size: 128, elements: !185)
!185 = !{!102}
!186 = !DILocation(line: 175, scope: !128)
!187 = !DILocation(line: 177, scope: !128)
!188 = !DILocation(line: 178, scope: !128)
!189 = !DILocalVariable(name: "result", scope: !128, file: !1, line: 175, type: !85)
!190 = !DILocation(line: 200, scope: !128)
!191 = distinct !DISubprogram(name: "get_basic_type_size", linkageName: "init.get_basic_type_size", scope: !1, file: !1, line: 203, type: !192, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !87)
!192 = !DISubroutineType(types: !193)
!193 = !{!85, !140}
!194 = !DILocation(line: 203, scope: !191)
!195 = !DILocalVariable(name: "t", scope: !191, file: !1, line: 203, type: !140)
!196 = !DILocation(line: 204, scope: !191)
!197 = !DILocation(line: 205, scope: !191)
!198 = !DILocation(line: 206, scope: !191)
!199 = distinct !DISubprogram(name: "get_struct_size", linkageName: "init.get_struct_size", scope: !1, file: !1, line: 209, type: !83, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !87)
!200 = !DILocation(line: 209, scope: !199)
!201 = !DILocalVariable(name: "st", scope: !199, file: !1, line: 209, type: !86)
!202 = !DILocation(line: 210, scope: !199)
!203 = !DILocalVariable(name: "t", scope: !199, file: !1, line: 210, type: !92)
!204 = !DILocation(line: 211, scope: !199)
!205 = !DILocation(line: 212, scope: !199)
!206 = !DILocation(line: 214, scope: !199)
!207 = !DILocalVariable(name: "result", scope: !199, file: !1, line: 214, type: !85)
!208 = !DILocation(line: 215, scope: !199)
!209 = !DILocalVariable(name: "biggest_member", scope: !199, file: !1, line: 215, type: !85)
!210 = !DILocation(line: 216, scope: !199)
!211 = !DILocalVariable(name: "m", scope: !199, file: !1, line: 216, type: !100)
!212 = !DILocalVariable(name: "i", scope: !199, file: !1, line: 216, type: !85)
!213 = !DILocation(line: 217, scope: !199)
!214 = !DILocalVariable(name: "member_size", scope: !199, file: !1, line: 217, type: !85)
!215 = !DILocation(line: 218, scope: !199)
!216 = !DILocalVariable(name: "alignment", scope: !199, file: !1, line: 218, type: !85)
!217 = !DILocation(line: 219, scope: !199)
!218 = !DILocation(line: 220, scope: !199)
!219 = !DILocation(line: 221, scope: !199)
!220 = !DILocation(line: 222, scope: !199)
!221 = !DILocation(line: 223, scope: !199)
!222 = !DILocation(line: 225, scope: !199)
!223 = !DILocation(line: 226, scope: !199)
!224 = !DILocation(line: 227, scope: !199)
!225 = !DILocalVariable(name: "align", scope: !199, file: !1, line: 227, type: !85)
!226 = !DILocation(line: 228, scope: !199)
!227 = !DILocation(line: 229, scope: !199)
!228 = distinct !DISubprogram(name: "get_type_size", linkageName: "init.get_type_size", scope: !1, file: !1, line: 232, type: !83, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !87)
!229 = !DILocation(line: 232, scope: !228)
!230 = !DILocalVariable(name: "t", scope: !228, file: !1, line: 232, type: !86)
!231 = !DILocation(line: 233, scope: !228)
!232 = !DILocalVariable(name: "ti", scope: !228, file: !1, line: 233, type: !133)
!233 = !DILocation(line: 234, scope: !228)
!234 = !DILocalVariable(name: "result", scope: !228, file: !1, line: 234, type: !85)
!235 = !DILocation(line: 257, scope: !228)
!236 = distinct !DISubprogram(name: "get_struct_member_offset", linkageName: "init.get_struct_member_offset", scope: !1, file: !1, line: 260, type: !237, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !87)
!237 = !DISubroutineType(types: !238)
!238 = !{!85, !92, !85}
!239 = !DILocation(line: 260, scope: !236)
!240 = !DILocalVariable(name: "st", scope: !236, file: !1, line: 260, type: !92)
