; ModuleID = 'io'
source_filename = "io.rcp"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%string = type { ptr, i64 }
%slice.5 = type { i64, ptr }
%init.TypeInfo = type { i64, %init.TypeUnion }
%init.TypeUnion = type { %init.StructType }
%init.StructType = type { %slice, %string, i32 }
%slice = type { i64, ptr }
%slice.1 = type { i64, ptr }
%init.BasicType = type { i64, i32, i32, %string }
%init.FunctionType = type { %slice.1, %slice.1 }
%init.PointerType = type { i64, i1 }
%init.ArrayType = type { i64, i32 }
%init.SliceType = type { i64 }
%init.EnumType = type { %string, %slice.2, i64 }
%slice.2 = type { i64, ptr }
%init.GenericType = type { %string }
%init.Arg = type { i64, ptr }
%init.StructMember = type { %string, i64 }
%mem.Allocator = type { ptr, ptr, ptr }
%slice.6 = type { i64, ptr }
%slice.3 = type { i64, ptr }
%slice.7 = type { i64, ptr }

@main.test_string = external global %string
@init.INVALID_TYPE = external global i64
@init.type_table = external global %slice.5
@os.STD_INPUT_HANDLE = external global i32
@os.STD_OUTPUT_HANDLE = external global i32
@os.STD_ERROR_HANDLE = external global i32
@os.INVALID_HANDLE_VALUE = external global ptr
@os.CP_UTF7 = external global i32
@os.CP_UTF8 = external global i32
@os.MEM_COMMIT = external global i32
@os.MEM_RESERVE = external global i32
@os.MEM_RELEASE = external global i32
@os.PAGE_NOACCESS = external global i32

!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "init.TypeKind", scope: !1, file: !1, size: 64, align: 64, elements: !4)
!4 = !{!5, !6, !7, !8, !9, !10, !11, !12, !13, !14}
!5 = !DIEnumerator(name: "Invalid", value: 0, isUnsigned: true)
!6 = !DIEnumerator(name: "Basic", value: 1, isUnsigned: true)
!7 = !DIEnumerator(name: "Function", value: 2, isUnsigned: true)
!8 = !DIEnumerator(name: "Struct", value: 3, isUnsigned: true)
!9 = !DIEnumerator(name: "Pointer", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "Array", value: 5, isUnsigned: true)
!11 = !DIEnumerator(name: "Slice", value: 6, isUnsigned: true)
!12 = !DIEnumerator(name: "Vector", value: 7, isUnsigned: true)
!13 = !DIEnumerator(name: "Enum", value: 8, isUnsigned: true)
!14 = !DIEnumerator(name: "Generic", value: 9, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "init.BasicKind", scope: !1, file: !1, size: 64, align: 64, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35}
!17 = !DIEnumerator(name: "Bool", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "String", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "U8", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "U16", value: 3, isUnsigned: true)
!21 = !DIEnumerator(name: "U32", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "U64", value: 5, isUnsigned: true)
!23 = !DIEnumerator(name: "I8", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "I16", value: 7, isUnsigned: true)
!25 = !DIEnumerator(name: "I32", value: 8, isUnsigned: true)
!26 = !DIEnumerator(name: "I64", value: 9, isUnsigned: true)
!27 = !DIEnumerator(name: "F32", value: 10, isUnsigned: true)
!28 = !DIEnumerator(name: "F64", value: 11, isUnsigned: true)
!29 = !DIEnumerator(name: "untypedInteger", value: 12, isUnsigned: true)
!30 = !DIEnumerator(name: "untypedFloat", value: 13, isUnsigned: true)
!31 = !DIEnumerator(name: "Int", value: 14, isUnsigned: true)
!32 = !DIEnumerator(name: "Uint", value: 15, isUnsigned: true)
!33 = !DIEnumerator(name: "Type", value: 16, isUnsigned: true)
!34 = !DIEnumerator(name: "Auto", value: 17, isUnsigned: true)
!35 = !DIEnumerator(name: "Module", value: 18, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "init.BasicFlag", scope: !1, file: !1, size: 32, align: 32, elements: !37)
!37 = !{!38, !39, !40, !41, !42, !43, !44}
!38 = !DIEnumerator(name: "Boolean", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "Integer", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "Float", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "String", value: 8, isUnsigned: true)
!42 = !DIEnumerator(name: "Untyped", value: 32, isUnsigned: true)
!43 = !DIEnumerator(name: "Unsigned", value: 64, isUnsigned: true)
!44 = !DIEnumerator(name: "TypeID", value: 128, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "init.StructFlag", scope: !1, file: !1, size: 32, align: 32, elements: !46)
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "Packed", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "Generic", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "Union", value: 4, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "init.VectorKind", scope: !1, file: !1, size: 64, align: 64, elements: !51)
!51 = !{!52, !53}
!52 = !DIEnumerator(name: "Float", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "Int", value: 1, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "compile.CompileFlag", scope: !1, file: !1, size: 32, align: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64}
!56 = !DIEnumerator(name: "Debug", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "SanAddress", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "SanMemory", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "SanThread", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "SanUndefined", value: 16, isUnsigned: true)
!61 = !DIEnumerator(name: "NoStdLib", value: 32, isUnsigned: true)
!62 = !DIEnumerator(name: "SharedLib", value: 64, isUnsigned: true)
!63 = !DIEnumerator(name: "CrossAndroid", value: 128, isUnsigned: true)
!64 = !DIEnumerator(name: "NoLink", value: 256, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "compile.Arch", scope: !1, file: !1, size: 32, align: 32, elements: !66)
!66 = !{!67, !68, !69, !70}
!67 = !DIEnumerator(name: "x86_64", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "x86", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "Arm32", value: 2, isUnsigned: true)
!70 = !DIEnumerator(name: "Arm64", value: 4, isUnsigned: true)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "json.Type", scope: !1, file: !1, size: 64, align: 64, elements: !72)
!72 = !{!73, !74, !75, !76, !77, !78, !79}
!73 = !DIEnumerator(name: "Number", value: 0, isUnsigned: true)
!74 = !DIEnumerator(name: "Integer", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "String", value: 2, isUnsigned: true)
!76 = !DIEnumerator(name: "Object", value: 3, isUnsigned: true)
!77 = !DIEnumerator(name: "Array", value: 4, isUnsigned: true)
!78 = !DIEnumerator(name: "Boolean", value: 5, isUnsigned: true)
!79 = !DIEnumerator(name: "Null", value: 6, isUnsigned: true)
!80 = !{i32 2, !"CodeView", i32 1}
!81 = !{i32 2, !"Debug Info Version", i32 3}
!82 = distinct !DISubprogram(name: "push_string", linkageName: "io.push_string", scope: !1, file: !1, line: 9, type: !83, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !99)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !85, !93}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*[]u32", baseType: !86, size: 64, align: 64, dwarfAddressSpace: 0)
!86 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1, file: !1, size: 128, align: 64, elements: !87)
!87 = !{!88, !90}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1, file: !1, baseType: !89, size: 64, align: 64)
!89 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u32", baseType: !92, size: 64, align: 64, dwarfAddressSpace: 0)
!92 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", scope: !1, file: !1, size: 128, elements: !94)
!94 = !{!95, !98}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u8", baseType: !97, size: 64, align: 64, dwarfAddressSpace: 0)
!97 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1, file: !1, baseType: !89, size: 64, align: 64, offset: 64)
!99 = !{}
!100 = !DILocation(line: 9, scope: !82)
!101 = !DILocalVariable(name: "b", scope: !82, file: !1, line: 9, type: !85)
!102 = !DILocalVariable(name: "to_push", arg: 1, scope: !82, file: !1, line: 9, type: !93)
!103 = !DILocation(line: 10, scope: !82)
!104 = !DILocalVariable(name: "c", scope: !82, file: !1, line: 10, type: !92)
!105 = !DILocalVariable(name: "i", scope: !82, file: !1, line: 10, type: !89)
!106 = !DILocation(line: 11, scope: !82)
!107 = !DILocation(line: 13, scope: !82)
!108 = distinct !DISubprogram(name: "format_uint", linkageName: "io.format_uint", scope: !1, file: !1, line: 15, type: !109, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !99)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !85, !111}
!111 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!112 = !DILocation(line: 15, scope: !108)
!113 = !DILocalVariable(name: "b", scope: !108, file: !1, line: 15, type: !85)
!114 = !DILocalVariable(name: "num_in", arg: 1, scope: !108, file: !1, line: 15, type: !111)
!115 = !DILocation(line: 16, scope: !108)
!116 = !DILocalVariable(name: "temp", scope: !108, file: !1, line: 16, type: !117)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 8192, align: 32, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 256, lowerBound: 0)
!120 = !DILocation(line: 17, scope: !108)
!121 = !DILocalVariable(name: "num", scope: !108, file: !1, line: 17, type: !111)
!122 = !DILocation(line: 18, scope: !108)
!123 = !DILocation(line: 19, scope: !108)
!124 = !DILocation(line: 20, scope: !108)
!125 = !DILocation(line: 23, scope: !108)
!126 = !DILocalVariable(name: "count", scope: !108, file: !1, line: 23, type: !89)
!127 = !DILocation(line: 24, scope: !108)
!128 = !DILocation(line: 25, scope: !108)
!129 = !DILocalVariable(name: "digit", scope: !108, file: !1, line: 25, type: !111)
!130 = !DILocation(line: 26, scope: !108)
!131 = !DILocation(line: 27, scope: !108)
!132 = !DILocalVariable(name: "c", scope: !108, file: !1, line: 27, type: !111)
!133 = !DILocation(line: 28, scope: !108)
!134 = !DILocation(line: 29, scope: !108)
!135 = !DILocation(line: 32, scope: !108)
!136 = !DILocalVariable(name: "i", scope: !108, file: !1, line: 32, type: !89)
!137 = !DILocation(line: 33, scope: !108)
!138 = !DILocation(line: 35, scope: !108)
!139 = distinct !DISubprogram(name: "format_int", linkageName: "io.format_int", scope: !1, file: !1, line: 37, type: !140, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !99)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !85, !89}
!142 = !DILocation(line: 37, scope: !139)
!143 = !DILocalVariable(name: "b", scope: !139, file: !1, line: 37, type: !85)
!144 = !DILocalVariable(name: "num_in", arg: 1, scope: !139, file: !1, line: 37, type: !89)
!145 = !DILocation(line: 38, scope: !139)
!146 = !DILocalVariable(name: "temp", scope: !139, file: !1, line: 38, type: !117)
!147 = !DILocation(line: 39, scope: !139)
!148 = !DILocalVariable(name: "num", scope: !139, file: !1, line: 39, type: !89)
!149 = !DILocation(line: 40, scope: !139)
!150 = !DILocation(line: 41, scope: !139)
!151 = !DILocation(line: 42, scope: !139)
!152 = !DILocation(line: 45, scope: !139)
!153 = !DILocalVariable(name: "is_neg", scope: !139, file: !1, line: 45, type: !154)
!154 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!155 = !DILocation(line: 46, scope: !139)
!156 = !DILocation(line: 47, scope: !139)
!157 = !DILocation(line: 48, scope: !139)
!158 = !DILocation(line: 51, scope: !139)
!159 = !DILocalVariable(name: "count", scope: !139, file: !1, line: 51, type: !89)
!160 = !DILocation(line: 52, scope: !139)
!161 = !DILocation(line: 53, scope: !139)
!162 = !DILocalVariable(name: "digit", scope: !139, file: !1, line: 53, type: !89)
!163 = !DILocation(line: 54, scope: !139)
!164 = !DILocation(line: 55, scope: !139)
!165 = !DILocalVariable(name: "c", scope: !139, file: !1, line: 55, type: !92)
!166 = !DILocation(line: 56, scope: !139)
!167 = !DILocation(line: 57, scope: !139)
!168 = !DILocation(line: 60, scope: !139)
!169 = !DILocation(line: 62, scope: !139)
!170 = !DILocalVariable(name: "i", scope: !139, file: !1, line: 62, type: !89)
!171 = !DILocation(line: 63, scope: !139)
!172 = !DILocation(line: 65, scope: !139)
!173 = distinct !DISubprogram(name: "print_typetype", linkageName: "io.print_typetype", scope: !1, file: !1, line: 127, type: !174, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !99)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !85, !176}
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.TypeInfo", scope: !1, file: !1, size: 384, elements: !177)
!177 = !{!178, !179}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !1, file: !1, baseType: !3, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !180, size: 320, align: 64, offset: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.TypeUnion", scope: !1, file: !1, size: 320, elements: !181)
!181 = !{!182, !189, !203, !212, !217, !222, !225, !234, !239}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !1, file: !1, baseType: !183, size: 256, align: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.BasicType", scope: !1, file: !1, size: 256, elements: !184)
!184 = !{!185, !186, !187, !188}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !1, file: !1, baseType: !15, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1, file: !1, baseType: !92, size: 32, align: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1, file: !1, baseType: !92, size: 32, align: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1, file: !1, baseType: !93, size: 128, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "struct_", scope: !1, file: !1, baseType: !190, size: 320, align: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.StructType", scope: !1, file: !1, size: 320, elements: !191)
!191 = !{!192, !188, !202}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "members", scope: !1, file: !1, baseType: !193, size: 128, align: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1, file: !1, size: 128, align: 64, elements: !194)
!194 = !{!88, !195}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !196, size: 64, align: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*init.StructMember", baseType: !197, size: 64, align: 64, dwarfAddressSpace: 0)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.StructMember", scope: !1, file: !1, size: 192, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1, file: !1, baseType: !93, size: 128, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !201, size: 64, align: 64, offset: 128)
!201 = !DIBasicType(name: "type", size: 64, encoding: DW_ATE_unsigned)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1, file: !1, baseType: !92, size: 32, align: 32, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !1, file: !1, baseType: !204, size: 256, align: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.FunctionType", scope: !1, file: !1, size: 256, elements: !205)
!205 = !{!206, !211}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "returns", scope: !1, file: !1, baseType: !207, size: 128, align: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1, file: !1, size: 128, align: 64, elements: !208)
!208 = !{!88, !209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !210, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*type", baseType: !201, size: 64, align: 64, dwarfAddressSpace: 0)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "args_t", scope: !1, file: !1, baseType: !207, size: 128, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1, file: !1, baseType: !213, size: 128, align: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.PointerType", scope: !1, file: !1, size: 128, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pointee", scope: !1, file: !1, baseType: !201, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "is_optional", scope: !1, file: !1, baseType: !154, size: 8, align: 8, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !1, file: !1, baseType: !218, size: 128, align: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.ArrayType", scope: !1, file: !1, size: 128, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !201, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "member_count", scope: !1, file: !1, baseType: !92, size: 32, align: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !1, file: !1, baseType: !223, size: 64, align: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.SliceType", scope: !1, file: !1, size: 64, elements: !224)
!224 = !{!220}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "enum_", scope: !1, file: !1, baseType: !226, size: 320, align: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.EnumType", scope: !1, file: !1, size: 320, elements: !227)
!227 = !{!199, !228, !233}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "member_names", scope: !1, file: !1, baseType: !229, size: 128, align: 64, offset: 128)
!229 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1, file: !1, size: 128, align: 64, elements: !230)
!230 = !{!88, !231}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !232, size: 64, align: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*string", baseType: !93, size: 64, align: 64, dwarfAddressSpace: 0)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !201, size: 64, align: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1, file: !1, baseType: !235, size: 128, align: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.VectorType", scope: !1, file: !1, size: 128, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !1, file: !1, baseType: !50, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "elem_count", scope: !1, file: !1, baseType: !92, size: 32, align: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !1, file: !1, baseType: !240, size: 128, align: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.GenericType", scope: !1, file: !1, size: 128, elements: !241)
!241 = !{!199}
!242 = !DILocation(line: 127, scope: !173)
!243 = !DILocalVariable(name: "b", scope: !173, file: !1, line: 127, type: !85)
!244 = !DILocalVariable(name: "info", arg: 1, scope: !173, file: !1, line: 127, type: !176)
!245 = !DILocation(line: 128, scope: !173)
!246 = !DILocation(line: 130, scope: !173)
!247 = !DILocation(line: 133, scope: !173)
!248 = !DILocation(line: 136, scope: !173)
!249 = !DILocation(line: 137, scope: !173)
!250 = !DILocalVariable(name: "args", scope: !173, file: !1, line: 137, type: !207)
!251 = !DILocation(line: 138, scope: !173)
!252 = !DILocalVariable(name: "arg", scope: !173, file: !1, line: 138, type: !201)
!253 = !DILocalVariable(name: "i", scope: !173, file: !1, line: 138, type: !89)
!254 = !DILocation(line: 139, scope: !173)
!255 = !DILocation(line: 140, scope: !173)
!256 = !DILocation(line: 141, scope: !173)
!257 = !DILocation(line: 144, scope: !173)
!258 = !DILocation(line: 145, scope: !173)
!259 = !DILocation(line: 146, scope: !173)
!260 = !DILocation(line: 147, scope: !173)
!261 = !DILocalVariable(name: "t", scope: !173, file: !1, line: 147, type: !201)
!262 = !DILocalVariable(name: "i", scope: !173, file: !1, line: 147, type: !89)
!263 = !DILocation(line: 148, scope: !173)
!264 = !DILocation(line: 149, scope: !173)
!265 = !DILocation(line: 150, scope: !173)
!266 = !DILocation(line: 155, scope: !173)
!267 = !DILocation(line: 158, scope: !173)
!268 = !DILocation(line: 159, scope: !173)
!269 = !DILocation(line: 162, scope: !173)
!270 = !DILocation(line: 163, scope: !173)
!271 = !DILocation(line: 166, scope: !173)
!272 = !DILocation(line: 167, scope: !173)
!273 = !DILocation(line: 170, scope: !173)
!274 = !DILocation(line: 173, scope: !173)
!275 = !DILocation(line: 176, scope: !173)
!276 = !DILocation(line: 180, scope: !173)
!277 = distinct !DISubprogram(name: "print_type", linkageName: "io.print_type", scope: !1, file: !1, line: 182, type: !278, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !99)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !85, !280}
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.Arg", scope: !1, file: !1, size: 128, elements: !281)
!281 = !{!220, !282}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1, file: !1, baseType: !283, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*void", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!284 = !DILocation(line: 182, scope: !277)
!285 = !DILocalVariable(name: "b", scope: !277, file: !1, line: 182, type: !85)
!286 = !DILocalVariable(name: "arg", arg: 1, scope: !277, file: !1, line: 182, type: !280)
!287 = !DILocation(line: 183, scope: !277)
!288 = !DILocalVariable(name: "t", scope: !277, file: !1, line: 183, type: !176)
!289 = !DILocation(line: 184, scope: !277)
!290 = !DILocation(line: 188, scope: !277)
!291 = !DILocalVariable(name: "basic", scope: !277, file: !1, line: 188, type: !183)
!292 = !DILocation(line: 189, scope: !277)
!293 = !DILocation(line: 190, scope: !277)
!294 = !DILocation(line: 191, scope: !277)
!295 = !DILocation(line: 193, scope: !277)
!296 = !DILocation(line: 196, scope: !277)
!297 = !DILocation(line: 197, scope: !277)
!298 = !DILocalVariable(name: "str", scope: !277, file: !1, line: 197, type: !93)
!299 = !DILocation(line: 198, scope: !277)
!300 = !DILocation(line: 207, scope: !277)
!301 = !DILocation(line: 208, scope: !277)
!302 = !DILocalVariable(name: "num", scope: !277, file: !1, line: 208, type: !111)
!303 = !DILocation(line: 209, scope: !277)
!304 = !DILocation(line: 211, scope: !277)
!305 = !DILocation(line: 212, scope: !277)
!306 = !DILocalVariable(name: "num", scope: !277, file: !1, line: 212, type: !111)
!307 = !DILocation(line: 213, scope: !277)
!308 = !DILocation(line: 215, scope: !277)
!309 = !DILocation(line: 216, scope: !277)
!310 = !DILocalVariable(name: "num", scope: !277, file: !1, line: 216, type: !111)
!311 = !DILocation(line: 217, scope: !277)
!312 = !DILocation(line: 219, scope: !277)
!313 = !DILocation(line: 220, scope: !277)
!314 = !DILocalVariable(name: "num", scope: !277, file: !1, line: 220, type: !111)
!315 = !DILocation(line: 221, scope: !277)
!316 = !DILocation(line: 223, scope: !277)
!317 = !DILocation(line: 224, scope: !277)
!318 = !DILocalVariable(name: "num", scope: !277, file: !1, line: 224, type: !89)
!319 = !DILocation(line: 225, scope: !277)
!320 = !DILocation(line: 227, scope: !277)
!321 = !DILocation(line: 228, scope: !277)
!322 = !DILocalVariable(name: "num", scope: !277, file: !1, line: 228, type: !89)
!323 = !DILocation(line: 229, scope: !277)
!324 = !DILocation(line: 231, scope: !277)
!325 = !DILocation(line: 232, scope: !277)
!326 = !DILocalVariable(name: "num", scope: !277, file: !1, line: 232, type: !89)
!327 = !DILocation(line: 233, scope: !277)
!328 = !DILocation(line: 235, scope: !277)
!329 = !DILocation(line: 236, scope: !277)
!330 = !DILocalVariable(name: "num", scope: !277, file: !1, line: 236, type: !89)
!331 = !DILocation(line: 237, scope: !277)
!332 = !DILocation(line: 239, scope: !277)
!333 = !DILocation(line: 240, scope: !277)
!334 = !DILocalVariable(name: "num", scope: !277, file: !1, line: 240, type: !89)
!335 = !DILocation(line: 241, scope: !277)
!336 = !DILocation(line: 243, scope: !277)
!337 = !DILocation(line: 244, scope: !277)
!338 = !DILocalVariable(name: "num", scope: !277, file: !1, line: 244, type: !111)
!339 = !DILocation(line: 245, scope: !277)
!340 = !DILocation(line: 247, scope: !277)
!341 = !DILocation(line: 248, scope: !277)
!342 = !DILocalVariable(name: "num", scope: !277, file: !1, line: 248, type: !343)
!343 = !DIBasicType(name: "f32", size: 32, encoding: DW_ATE_float)
!344 = !DILocation(line: 249, scope: !277)
!345 = !DILocation(line: 251, scope: !277)
!346 = !DILocation(line: 252, scope: !277)
!347 = !DILocalVariable(name: "num", scope: !277, file: !1, line: 252, type: !348)
!348 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!349 = !DILocation(line: 253, scope: !277)
!350 = !DILocation(line: 255, scope: !277)
!351 = !DILocation(line: 256, scope: !277)
!352 = !DILocalVariable(name: "pt", scope: !277, file: !1, line: 256, type: !201)
!353 = !DILocation(line: 257, scope: !277)
!354 = !DILocalVariable(name: "info", scope: !277, file: !1, line: 257, type: !176)
!355 = !DILocation(line: 258, scope: !277)
!356 = !DILocation(line: 261, scope: !277)
!357 = !DILocation(line: 267, scope: !277)
!358 = !DILocalVariable(name: "st", scope: !277, file: !1, line: 267, type: !190)
!359 = !DILocation(line: 268, scope: !277)
!360 = !DILocation(line: 269, scope: !277)
!361 = !DILocation(line: 270, scope: !277)
!362 = !DILocalVariable(name: "n", scope: !277, file: !1, line: 270, type: !89)
!363 = !DILocation(line: 271, scope: !277)
!364 = !DILocalVariable(name: "m", scope: !277, file: !1, line: 271, type: !197)
!365 = !DILocation(line: 272, scope: !277)
!366 = !DILocation(line: 273, scope: !277)
!367 = !DILocation(line: 274, scope: !277)
!368 = !DILocalVariable(name: "ptr", scope: !277, file: !1, line: 274, type: !96)
!369 = !DILocation(line: 275, scope: !277)
!370 = !DILocalVariable(name: "offset", scope: !277, file: !1, line: 275, type: !89)
!371 = !DILocation(line: 276, scope: !277)
!372 = !DILocalVariable(name: "mem_arg", scope: !277, file: !1, line: 276, type: !280)
!373 = !DILocation(line: 280, scope: !277)
!374 = !DILocation(line: 282, scope: !277)
!375 = !DILocation(line: 283, scope: !277)
!376 = !DILocation(line: 284, scope: !277)
!377 = !DILocation(line: 287, scope: !277)
!378 = !DILocation(line: 298, scope: !277)
!379 = !DILocalVariable(name: "e", scope: !277, file: !1, line: 298, type: !226)
!380 = !DILocation(line: 299, scope: !277)
!381 = !DILocalVariable(name: "size", scope: !277, file: !1, line: 299, type: !89)
!382 = !DILocation(line: 300, scope: !277)
!383 = !DILocalVariable(name: "val", scope: !277, file: !1, line: 300, type: !89)
!384 = !DILocation(line: 307, scope: !277)
!385 = !DILocation(line: 308, scope: !277)
!386 = !DILocation(line: 314, scope: !277)
!387 = distinct !DISubprogram(name: "builder_to_string", linkageName: "io.builder_to_string", scope: !1, file: !1, line: 316, type: !388, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !99)
!388 = !DISubroutineType(types: !389)
!389 = !{!390, !85}
!390 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1, file: !1, size: 128, align: 64, elements: !391)
!391 = !{!88, !392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !96, size: 64, align: 64, offset: 64)
!393 = !DILocation(line: 316, scope: !387)
!394 = !DILocalVariable(name: "b_in", scope: !387, file: !1, line: 316, type: !85)
!395 = !DILocation(line: 317, scope: !387)
!396 = !DILocalVariable(name: "b", scope: !387, file: !1, line: 317, type: !85)
!397 = !DILocation(line: 318, scope: !387)
!398 = !DILocalVariable(name: "alloc", scope: !387, file: !1, line: 318, type: !399)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "mem.Allocator", scope: !1, file: !1, size: 192, elements: !400)
!400 = !{!401, !407, !411}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1, file: !1, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*fn(int, *mem.Allocator) -> ?*", baseType: !403, size: 64, align: 64, dwarfAddressSpace: 0)
!403 = !DISubroutineType(types: !404)
!404 = !{!283, !89, !405}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mem.Allocator", baseType: !406, size: 64, align: 64, dwarfAddressSpace: 0)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "mem.Allocator", scope: !1, file: !1, size: 192, align: 64, flags: DIFlagFwdDecl)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1, file: !1, baseType: !408, size: 64, align: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*fn(*, *mem.Allocator)", baseType: !409, size: 64, align: 64, dwarfAddressSpace: 0)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !283, !405}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !283, size: 64, align: 64, offset: 128)
!412 = !DILocation(line: 319, scope: !387)
!413 = !DILocalVariable(name: "res", scope: !387, file: !1, line: 319, type: !390)
!414 = !DILocation(line: 321, scope: !387)
!415 = !DILocalVariable(name: "i", scope: !387, file: !1, line: 321, type: !89)
!416 = !DILocation(line: 322, scope: !387)
!417 = !DILocalVariable(name: "ptr", scope: !387, file: !1, line: 322, type: !96)
!418 = !DILocation(line: 323, scope: !387)
!419 = !DILocation(line: 324, scope: !387)
!420 = !DILocation(line: 325, scope: !387)
!421 = !DILocation(line: 328, scope: !387)
!422 = !DILocalVariable(name: "size", scope: !387, file: !1, line: 328, type: !89)
!423 = !DILocation(line: 329, scope: !387)
!424 = !DILocalVariable(name: "j", scope: !387, file: !1, line: 329, type: !89)
!425 = !DILocation(line: 330, scope: !387)
!426 = !DILocation(line: 334, scope: !387)
!427 = distinct !DISubprogram(name: "print_type_with_formatter", linkageName: "io.print_type_with_formatter", scope: !1, file: !1, line: 337, type: !428, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !99)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !85, !92, !280}
!430 = !DILocation(line: 337, scope: !427)
!431 = !DILocalVariable(name: "b", scope: !427, file: !1, line: 337, type: !85)
!432 = !DILocalVariable(name: "c", arg: 1, scope: !427, file: !1, line: 337, type: !92)
!433 = !DILocalVariable(name: "arg", arg: 2, scope: !427, file: !1, line: 337, type: !280)
!434 = !DILocation(line: 338, scope: !427)
!435 = !DILocalVariable(name: "t", scope: !427, file: !1, line: 338, type: !176)
!436 = !DILocation(line: 339, scope: !427)
!437 = !DILocation(line: 340, scope: !427)
!438 = !DILocalVariable(name: "str", scope: !427, file: !1, line: 340, type: !96)
!439 = !DILocation(line: 341, scope: !427)
!440 = !DILocalVariable(name: "i", scope: !427, file: !1, line: 341, type: !89)
!441 = !DILocation(line: 342, scope: !427)
!442 = !DILocation(line: 344, scope: !427)
!443 = !DILocation(line: 346, scope: !427)
!444 = !DILocalVariable(name: "c", scope: !427, file: !1, line: 346, type: !92)
!445 = !DILocation(line: 347, scope: !427)
!446 = !DILocation(line: 348, scope: !427)
!447 = !DILocation(line: 349, scope: !427)
!448 = !DILocation(line: 350, scope: !427)
!449 = !DILocation(line: 352, scope: !427)
!450 = !DILocation(line: 354, scope: !427)
!451 = !DILocation(line: 355, scope: !427)
!452 = !DILocation(line: 356, scope: !427)
!453 = !DILocation(line: 358, scope: !427)
!454 = distinct !DISubprogram(name: "__internal_print", linkageName: "io.__internal_print", scope: !1, file: !1, line: 361, type: !455, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !99)
!455 = !DISubroutineType(types: !456)
!456 = !{!86, !93, !457}
!457 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1, file: !1, size: 128, align: 64, elements: !458)
!458 = !{!88, !459}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !460, size: 64, align: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*init.Arg", baseType: !280, size: 64, align: 64, dwarfAddressSpace: 0)
!461 = !DILocation(line: 361, scope: !454)
!462 = !DILocalVariable(name: "fmt", scope: !454, file: !1, line: 361, type: !93)
!463 = !DILocalVariable(name: "args", arg: 1, scope: !454, file: !1, line: 361, type: !457)
!464 = !DILocation(line: 362, scope: !454)
!465 = !DILocalVariable(name: "alloc", scope: !454, file: !1, line: 362, type: !399)
!466 = !DILocation(line: 363, scope: !454)
!467 = !DILocalVariable(name: "builder", scope: !454, file: !1, line: 363, type: !86)
!468 = !DILocation(line: 364, scope: !454)
!469 = !DILocalVariable(name: "arg_count", scope: !454, file: !1, line: 364, type: !89)
!470 = !DILocation(line: 365, scope: !454)
!471 = !DILocalVariable(name: "need_to_print_arg", scope: !454, file: !1, line: 365, type: !154)
!472 = !DILocation(line: 366, scope: !454)
!473 = !DILocalVariable(name: "c", scope: !454, file: !1, line: 366, type: !92)
!474 = !DILocalVariable(name: "i", scope: !454, file: !1, line: 366, type: !89)
!475 = !DILocation(line: 367, scope: !454)
!476 = !DILocation(line: 368, scope: !454)
!477 = !DILocation(line: 370, scope: !454)
!478 = !DILocation(line: 371, scope: !454)
!479 = !DILocalVariable(name: "arg", scope: !454, file: !1, line: 371, type: !280)
!480 = !DILocation(line: 372, scope: !454)
!481 = !DILocation(line: 373, scope: !454)
!482 = !DILocation(line: 374, scope: !454)
!483 = !DILocation(line: 376, scope: !454)
!484 = !DILocation(line: 381, scope: !454)
!485 = !DILocation(line: 382, scope: !454)
!486 = !DILocalVariable(name: "arg", scope: !454, file: !1, line: 382, type: !280)
!487 = !DILocation(line: 383, scope: !454)
!488 = !DILocation(line: 384, scope: !454)
!489 = !DILocation(line: 385, scope: !454)
!490 = !DILocation(line: 388, scope: !454)
!491 = distinct !DISubprogram(name: "vsprint", linkageName: "io.vsprint", scope: !1, file: !1, line: 392, type: !492, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !99)
!492 = !DISubroutineType(types: !493)
!493 = !{!93, !93, !457}
!494 = !DILocation(line: 392, scope: !491)
!495 = !DILocalVariable(name: "str", scope: !491, file: !1, line: 392, type: !93)
!496 = !DILocalVariable(name: "args", arg: 1, scope: !491, file: !1, line: 392, type: !457)
!497 = !DILocation(line: 393, scope: !491)
!498 = !DILocalVariable(name: "builder", scope: !491, file: !1, line: 393, type: !86)
!499 = !DILocation(line: 394, scope: !491)
!500 = !DILocalVariable(name: "res", scope: !491, file: !1, line: 394, type: !390)
!501 = !DILocation(line: 395, scope: !491)
!502 = !DILocation(line: 396, scope: !491)
!503 = distinct !DISubprogram(name: "sprint", linkageName: "io.sprint", scope: !1, file: !1, line: 399, type: !504, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !99)
!504 = !DISubroutineType(types: !505)
!505 = !{!93, !93}
!506 = !DILocation(line: 399, scope: !503)
!507 = !DILocalVariable(name: "str", scope: !503, file: !1, line: 399, type: !93)
!508 = !DILocalVariable(name: "args", arg: 1, scope: !503, file: !1, line: 399, type: !457)
!509 = !DILocation(line: 400, scope: !503)
!510 = !DILocalVariable(name: "builder", scope: !503, file: !1, line: 400, type: !86)
!511 = !DILocation(line: 401, scope: !503)
!512 = !DILocalVariable(name: "res", scope: !503, file: !1, line: 401, type: !390)
!513 = !DILocation(line: 402, scope: !503)
!514 = !DILocation(line: 403, scope: !503)
!515 = distinct !DISubprogram(name: "print", linkageName: "io.print", scope: !1, file: !1, line: 406, type: !516, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !99)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !93}
!518 = !DILocation(line: 406, scope: !515)
!519 = !DILocalVariable(name: "str", scope: !515, file: !1, line: 406, type: !93)
!520 = !DILocalVariable(name: "args", arg: 1, scope: !515, file: !1, line: 406, type: !457)
